---
kind: other
id: Properties.T:Autodesk.Revit.DB.FormulaManager
source: html/3d9538d3-ee4c-8f87-04f4-6ead508a90a7.htm
---
# FormulaManager Properties

Specifies whether the .NET object represents a valid Revit entity.